; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	spectrograph1 - mode
	image0 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation2 - direction
	Star6 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Star8 image0)
	(have_image Planet9 image0)
	(have_image Planet10 image0)
	(have_image Phenomenon11 image0)
	(have_image Planet12 image0)
	(have_image Phenomenon13 image0)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 image0)
))

)

; plan
1. (turn_to satellite1 groundstation2 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 9
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 1 of 9
4. (turn_to satellite1 planet10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 9
5. (take_image satellite1 planet10 instrument2 image0)
   added: (have_image planet10 image0)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon15 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon15 instrument2 image0)
   added: (have_image phenomenon15 image0)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon13 instrument2 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 9
10. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 9
11. (take_image satellite1 phenomenon11 instrument2 image0)
   added: (have_image phenomenon11 image0)
   goals met: 4 of 9
12. (turn_to satellite1 planet12 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet12)
   goals met: 4 of 9
13. (take_image satellite1 planet12 instrument2 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 9
14. (turn_to satellite1 planet14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet14)
   goals met: 5 of 9
15. (take_image satellite1 planet14 instrument2 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 9
16. (turn_to satellite1 planet9 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet9)
   goals met: 6 of 9
17. (take_image satellite1 planet9 instrument2 image0)
   added: (have_image planet9 image0)
   goals met: 7 of 9
18. (turn_to satellite1 star8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star8)
   goals met: 7 of 9
19. (take_image satellite1 star8 instrument2 image0)
   added: (have_image star8 image0)
   goals met: 8 of 9
20. (turn_to satellite1 groundstation2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation2)
   goals met: 9 of 9
